
Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = форма.Имяформы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
		ДобавитьСкидку (Форма);
		ДобавитьКнопкуПересчета (Форма) 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 	
	КонецЕсли;
	
КонецПроцедуры  


Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо";
	
КонецПроцедуры
	
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Расш1_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьСкидку (Форма)   
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
	ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении"); 	
КонецПроцедуры

Процедура ДобавитьКнопкуПересчета (Форма)
	
	Команда		= Форма.Команды.Добавить("КнопкаПересчета");
	Команда.Действие	= "КнопкаПересчета";
	Кнопка		= Форма.Элементы.Добавить("ВыполнитьМоюКоманду", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Кнопка.Заголовок	= "Пересчитать";
	Кнопка.ИмяКоманды	= "КнопкаПересчета";  
	
КонецПроцедуры
